templates/doc/template-doc.org
#+TITLE: C templates documentation
# #+OPTIONS: ^:nil
* C project templates
** What this is
   This repository contains C template files for your projects: Makefiles,
   generic C and ASM source files and a generic header file.
** Documentation
   | file                 | description                                                              |
   |----------------------+--------------------------------------------------------------------------|
   | Makefile-example     | An example makefile. Compiles generic sources including generic headers. |
   | Makefile-module      | A makefile template for libwowie modules                                 |
   | Makefile-project     | A makefile for your projects                                             |
   | doc                  | Documentation directory                                                  |
   | inc                  | Inculdes directory (contains header files)                               |
   | src                  | Source code files                                                        |
   |----------------------+--------------------------------------------------------------------------|
   | ../doc:              |                                                                          |
   | project-doc.org      | Project documentation template                                           |
   | template-doc.org     | This file: the documentation for templates                               |
   |----------------------+--------------------------------------------------------------------------|
   | ../inc:              |                                                                          |
   | generic-header.h     | A generic C header file. Has annotated sections.                         |
   |----------------------+--------------------------------------------------------------------------|
   | ../src:              |                                                                          |
   | generic-asm-source.s | A generic ASM source file. Has annotated sections.                       |
   | generic-c-source.c   | A generic C source file. Has annotated sections.                         |

** Overview
   n/a
