templates/src/doc/template-doc.tex
% Created 2023-02-11 Sat 19:17
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Brian Jorgensen}
\date{\today}
\title{C templates documentation}
\hypersetup{
 pdfauthor={Brian Jorgensen},
 pdftitle={C templates documentation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{C project templates}
\label{sec:org69b74a4}
\subsection{What this is}
\label{sec:org4b69b2d}
This repository contains C template files for your projects: Makefiles,
generic C and ASM source files and a generic header file.
\subsection{Documentation}
\label{sec:orgca11c10}
\begin{center}
\begin{tabular}{ll}
file & description\\
\hline
Makefile-example & An example makefile. Compiles generic sources including generic headers.\\
Makefile-module & A makefile template for libwowie modules\\
Makefile-project & A makefile for your projects\\
doc & Documentation directory\\
inc & Inculdes directory (contains header files)\\
src & Source code files\\
\hline
../doc: & \\
project-doc.org & Project documentation template\\
template-doc.org & This file: the documentation for templates\\
\hline
../inc: & \\
generic-header.h & A generic C header file. Has annotated sections.\\
\hline
../src: & \\
generic-asm-source.s & A generic ASM source file. Has annotated sections.\\
generic-c-source.c & A generic C source file. Has annotated sections.\\
\end{tabular}
\end{center}

\subsection{Overview}
\label{sec:org6344d5d}
n/a
\end{document}
